taurus-blazemeter-digitalbank/DigitalBANK-Combined-JMeter-and-Selenium.yaml

# Script generated by Blazemeter Chrome Extension

modules:
  nose:
    ignore-unknown-actions: true

execution:
- executor: selenium
  scenario: DigitalBANK-Selenium
  
  capabilities: 
    browserName: chrome
  hold-for: 20m

- executor: jmeter
  scenario: DigitalBANK-Http
  concurrency: 20
  ramp-up: 1m
  hold-for: 19m

scenarios:
  DigitalBANK-Selenium:
    generate-flow-markers: true 
    headless: false
    timeout: 60s
    think-time: 0s
    requests:
    - label: Login
      actions:
      - resizeWindow(1853,876)
      - go(http://localhost:8080/bank/login?logout)

  DigitalBANK-Http:
    headers:
      Upgrade-Insecure-Requests: '1'
      User-Agent: 'Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/78.0.3904.70 Safari/537.36'
      Sec-Fetch-User: '?1'
      Accept: 'text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3'
    requests:
      - transaction: Login
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/bank/login'
            method: POST
            label: 'http://localhost:8080/bank/login'
            think-time: 0ms
            headers:
              Origin: 'http://localhost:8080'
              Content-Type: application/x-www-form-urlencoded
            body:
              password: 'Demo123!'
              username: jsmith@demo.io
      - transaction: Click Profile
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/bank/user/profile'
            method: GET
            label: 'http://localhost:8080/bank/user/profile'
            assert:
              - assume-success: false
                contains:
                  - Josh
                not: false
                regexp: false
                subject: body
              - assume-success: false
                contains:
                  - Smith
                not: false
                regexp: false
                subject: body
            think-time: 12505ms
            headers: {}
      - transaction: Home Page
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/bank/'
            method: GET
            label: 'http://localhost:8080/bank/'
            think-time: 28048ms
            headers: {}
      - transaction: Logout
        force-parent-sample: false
        do:
          - url: 'http://localhost:8080/bank/logout'
            method: GET
            label: 'http://localhost:8080/bank/logout'
            think-time: 14032ms
            headers: {}